![png](Images/ERD.png)

In [9]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'Ao9!#Gt8' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/Chinook)

In [10]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

   Tables_in_chinook
0              Album
1             Artist
2           Customer
3           Employee
4              Genre
5            Invoice
6        InvoiceLine
7          MediaType
8           Playlist
9      PlaylistTrack
10             Track

## Customer Queries

- Q1. What is the most a customer has spent on a single purchase and what is their customer Id?

In [11]:
q='''SELECT 
    customerId, MAX(Total)
FROM
    Invoice
GROUP BY customerId
ORDER BY MAX(Total) DESC
LIMIT 1; '''
pd.read_sql(q, engine)

   customerId  MAX(Total)
0           6       25.86

Q2. What country is the customer with the largest total bill from (from question 2)?

In [12]:
q='''SELECT 
    i.CustomerId, MAX(Total), c.Country
FROM
    Invoice AS i
        JOIN
    Customer AS c ON c.CustomerId = i.CustomerId
GROUP BY customerId
ORDER BY MAX(Total) DESC
LIMIT 1;'''
pd.read_sql(q, engine)

   CustomerId  MAX(Total)         Country
0           6       25.86  Czech Republic